const express = require('express');
const path = require('path');
const fs = require('fs');


//配置log4js end
const app = express();
console.log("---------------------------");
app.set('view engine', 'html'); // 设置模板引擎
app.set('views',path.join( __dirname,'view'));  // 设置模板相对路径(相对当前目录)
app.use(express.static(path.join(__dirname, 'public')));

// app.use('/public', express.static(path.join(__dirname, 'public/build')));
//app.use(favicon(__dirname + '/public/img/favicon.ico'));


console.log([
    "                   _ooOoo_",
    "                  o8888888o",
    "                  88\" . \"88",
    "                  (| -_- |)",
    "                  O\\  =  /O",
    "               ____/`---'\\____",
    "             .'  \\\\|     |//  `.",
    "            /  \\\\|||  :  |||//  \\",
    "           /  _||||| -:- |||||-  \\",
    "           |   | \\\\\\  -  /// |   |",
    "           | \\_|  ''\\---/''  |   |",
    "           \\  .-\\__  `-`  ___/-. /",
    "         ___`. .'  /--.--\\  `. . __",
    "      .\"\" '<  `.___\\_<|>_/___.'  >'\"\".",
    "     | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |",
    "     \\  \\ `-.   \\_ __\\ /__ _/   .-` /  /",
    "======`-.____`-.___\\_____/___.-`____.-'======",
    "                   `=---='",
    "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^",
    "         项目启动     佛祖保佑     永无BUG",
    "佛曰:",
    "    写字楼里写字间，写字间里程序员；",
    "    程序人员写程序，又拿程序换酒钱。",
    "    酒醒只在网上坐，酒醉还来网下眠；",
    "    酒醉酒醒日复日，网上网下年复年。",
    "    但愿老死电脑间，不愿鞠躬老板前；",
    "    奔驰宝马贵者趣，公交自行程序员。",
    "    别人笑我忒疯癫，我笑自己命太贱；",
    "    不见满街漂亮妹，哪个归得程序员？",
].join('\n'));





module.exports = app;
